tschissler/SmartHomeTS/ESP32Firmwares/RelaisBoard.Firmware/src/main.cpp
#include <Arduino.h>
#include <ArduinoJson.h>
#include <map>

#include <ESP32Ping.h>
#include <esp_mac.h> 
#include "AzureOTAUpdater.h"
#include "MQTTClientLib.h"
#include "WifiLib.h"

#define NUMBER_OF_RELAYS 8
#define RELAIS_1 19  
#define RELAIS_2 18
#define RELAIS_3 5
#define RELAIS_4 17
#define RELAIS_5 16
#define RELAIS_6 4
#define RELAIS_7 0
#define RELAIS_8 15

#define waitTime 100

const char* version = FIRMWARE_VERSION;
String chipID = "";

// Room to pin mapping (will be populated from MQTT config)
std::map<String, int> roomToPinMapping;

// Array of available relay pins for easier management
const int relayPins[NUMBER_OF_RELAYS] = {
  RELAIS_1, RELAIS_2, RELAIS_3, RELAIS_4, 
  RELAIS_5, RELAIS_6, RELAIS_7, RELAIS_8
};

// WiFi credentials are read from environment variables and used during compile-time (see platformio.ini)
// Set WIFI_PASSWORDS as environment variables on your dev-system following the pattern: WIFI_PASSWORDS="ssid1;password1|ssid2;password2"
WifiLib wifiLib(WIFI_PASSWORDS);

WiFiClient wifiClient;
WiFiUDP ntpUDP;
std::unique_ptr<MQTTClientLib> mqttClient = nullptr;

static bool otaInProgress = false;
static bool otaEnable = true;
static bool sendMQTTMessages = true;
static bool mqttSuccess = false;

static String baseTopic = "data/heating";
static String sensorName = "";
static String location = "";
const String mqtt_broker = "smarthomepi2";
static String mqtt_OTAtopic = "OTAUpdate/Relaismodule";
static String mqtt_SensornameTopic = "config/Relaismodule/Sensorname/";
static String mqtt_config_Base = "config/Relaismodule/";
static String mqtt_config_Topic = "";
static String mqtt_CommandsTopic = "commands/Heating/#";

// Function to get relay pin for a given pin number (1-8)
int getRelayPinByNumber(int pinNumber) {
  if (pinNumber >= 1 && pinNumber <= NUMBER_OF_RELAYS) {
    return relayPins[pinNumber - 1]; // Convert 1-based to 0-based index
  }
  return -1; // Invalid pin number
}

// Function to update room to pin mapping from JSON config
bool updateRoomMapping(const String& jsonConfig) {
  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, jsonConfig);
  
  if (error) {
    Serial.println("Failed to parse room mapping JSON: " + String(error.c_str()));
    return false;
  }
  
  // Clear existing mapping
  roomToPinMapping.clear();
  
  // Parse the JSON array
  if (!doc.is<JsonArray>()) {
    Serial.println("Room mapping JSON must be an array");
    return false;
  }
  
  JsonArray rooms = doc.as<JsonArray>();
  
  for (JsonObject room : rooms) {
    if (!room.containsKey("Room") || !room.containsKey("Pin")) {
      Serial.println("Room mapping entry missing 'Room' or 'Pin' field");
      continue;
    }
    
    String roomName = room["Room"].as<String>();
    int pinNumber = room["Pin"].as<int>();
    
    int actualPin = getRelayPinByNumber(pinNumber);
    if (actualPin == -1) {
      Serial.println("Invalid pin number " + String(pinNumber) + " for room " + roomName);
      continue;
    }
    
    roomToPinMapping[roomName] = actualPin;
    Serial.println("Mapped room '" + roomName + "' to pin " + String(pinNumber) + " (GPIO " + String(actualPin) + ")");
  }
  
  Serial.println("Room mapping updated with " + String(roomToPinMapping.size()) + " rooms");
  return true;
}

// Function to get relay pin for a room name
int getRelayPinForRoom(const String& roomName) {
  auto it = roomToPinMapping.find(roomName);
  if (it != roomToPinMapping.end()) {
    return it->second;
  }
  return -1; // Room not found
}



void mqttCallback(String &topic, String &payload) {
    Serial.println("Message arrived on topic: " + topic + ". Message: " + payload);

    // Handle room configuration updates
    if (topic == mqtt_config_Topic) {
      Serial.println("Received room configuration update");
      if (updateRoomMapping(payload)) {
        Serial.println("Room mapping configuration updated successfully");
      } else {
        Serial.println("Failed to update room mapping configuration");
      }
      return;
    }

    // Handle heating commands with dynamic room mapping
    if (topic.startsWith("commands/Heating/")) {
      String roomName = topic.substring(String("commands/Heating/").length());
      int relayPin = getRelayPinForRoom(roomName);
      
      if (relayPin != -1) {
          if (payload == "ON") {
              digitalWrite(relayPin, LOW); 
              Serial.println("Relay for room '" + roomName + "' turned ON (GPIO " + String(relayPin) + ")");
          } else if (payload == "OFF") {
              digitalWrite(relayPin, HIGH);
              Serial.println("Relay for room '" + roomName + "' turned OFF (GPIO " + String(relayPin) + ")");
          } else {
              Serial.println("Invalid payload for relay command. Use 'ON' or 'OFF'.");
          }
      } else {
          Serial.println("Room '" + roomName + "' not found in configuration. Available rooms:");
          for (const auto& mapping : roomToPinMapping) {
            Serial.println("  - " + mapping.first);
          }
      }
      return;
    }
    if (topic == mqtt_SensornameTopic) {
      sensorName = payload;
      location = payload;
      location.replace("Relaismodule_", "");
      Serial.println("Sensor name set to: " + sensorName);
      Serial.println("Location set to: " + location);
      mqtt_config_Topic = mqtt_config_Base + sensorName + "/Relais";
      Serial.println("Config topic set to: " + mqtt_config_Topic);
      
      mqttClient->subscribe(mqtt_config_Topic);
      Serial.println("Subscribed to config topic: " + mqtt_config_Topic);
      return;
    } 

    if (topic == mqtt_OTAtopic) {
      if (otaInProgress || !otaEnable) {
        if (otaInProgress)
          Serial.println("OTA in progress, ignoring message");
        if (!otaEnable)
          Serial.println("OTA disabled, ignoring message");
        return;
      }
  
      String updateVersion = AzureOTAUpdater::ExtractVersionFromUrl(payload);
      Serial.println("Current firmware version is " + String(version));
      Serial.println("New firmware version is " + updateVersion);
      if(strcmp(version, updateVersion.c_str())) {
          // Trigger OTA Update
          const char *firmwareUrl = payload.c_str();
          Serial.println("New firmware available, starting OTA Update from " + String(firmwareUrl));
          otaInProgress = true;
          bool result =  AzureOTAUpdater::UpdateFirmwareFromUrl(firmwareUrl);
          if (result) {
            Serial.println("OTA Update successful initiated, waiting to be finished");
          }
      }
      else {
        Serial.println("Firmware is up to date");
      }
    }
    else {
      Serial.println("Unknown topic, ignoring message");
    }
}

void connectToMQTT() {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("WiFi not connected, trying to reconnect...");
    wifiLib.connect();
  }
  mqttClient->connect({mqtt_SensornameTopic, mqtt_OTAtopic, mqtt_CommandsTopic, mqtt_config_Topic});
  Serial.println("MQTT Client is connected");
}

void setup() {
  Serial.begin(115200);

  Serial.print("Relais Module Version:");
  Serial.println(version);
  Serial.println("-------------------------------------------------------");

  uint8_t mac[6];
  esp_read_mac(mac, ESP_MAC_WIFI_STA);

  String chipID = "";
  for (int i = 0; i < 6; ++i) {
    if (mac[i] < 0x10) chipID += "0";  // Add leading zero if needed
    chipID += String(mac[i], HEX);
  }

  Serial.print("ESP32 Chip ID: ");
  Serial.println(chipID);

  mqtt_SensornameTopic += chipID;

  pinMode(RELAIS_1, OUTPUT);
  pinMode(RELAIS_2, OUTPUT);
  pinMode(RELAIS_3, OUTPUT);
  pinMode(RELAIS_4, OUTPUT);
  pinMode(RELAIS_5, OUTPUT);
  pinMode(RELAIS_6, OUTPUT);
  pinMode(RELAIS_7, OUTPUT);
  pinMode(RELAIS_8, OUTPUT);
  digitalWrite(RELAIS_1, HIGH);
  digitalWrite(RELAIS_2, HIGH);
  digitalWrite(RELAIS_3, HIGH);
  digitalWrite(RELAIS_4, HIGH);
  digitalWrite(RELAIS_5, HIGH);
  digitalWrite(RELAIS_6, HIGH);
  digitalWrite(RELAIS_7, HIGH);
  digitalWrite(RELAIS_8, HIGH);

  // Connect to WiFi
  Serial.print("Connecting to WiFi ");
  wifiLib.scanAndSelectNetwork();
  wifiLib.connect();
  String ssid = wifiLib.getSSID();
  
  // Set up MQTT
  String mqttClientID = "ESP32RelaismoduleClient_" + chipID;
  mqttClient = std::make_unique<MQTTClientLib>(mqtt_broker, mqttClientID, wifiClient, mqttCallback);
  connectToMQTT();

  // Print the IP address
  Serial.print("IP Address: ");
  Serial.println(WiFi.localIP());

  mqttClient->publish(("meta/" + sensorName + "/version").c_str(), String(version), true, 2);
}

void loop() {
    otaInProgress = AzureOTAUpdater::CheckUpdateStatus();
    if (otaInProgress) { delay (500); return; }

    if(!mqttClient->loop())
    {
      Serial.println("MQTT Client not connected, reconnecting in loop...");
      connectToMQTT();
    }

    delay(500);
}

